{
  "users": [
    {
      "login": "alex",
      "password": "qwerty123",
      "registed_at": "2025-04-10 09:00",
      "role_id": 0,
      "id": "67ff"
    },
    {
      "id": "7c77",
      "login": "reno",
      "password": "qwerqwer",
      "registed_at": "2025-05-19 12:59",
      "role_id": 2
    },
    {
      "id": "797d",
      "login": "Julia",
      "password": "qwerqwer",
      "registed_at": "2025-05-19 14:53",
      "role_id": 1
    }
  ],
  "roles": [
    {
      "id": "0",
      "name": "Администратор"
    },
    {
      "id": "1",
      "name": "Модератор"
    },
    {
      "id": "2",
      "name": "Читатель"
    },
    {
      "id": "3",
      "name": "Гость"
    }
  ],
  "posts": [
    {
      "id": "002",
      "title": "Начало начал, почему я так решил?",
      "img_url": "https://a.d-cd.net/BZS5tHFqCMG_iffwLZZPIaW_g-s-1920.jpg",
      "content": "Мне это было нужно.\nИ когда я перед монитором, вижу успех, это мотивирует и вдохновляет\n\n\n\n\n\nСложно, медленно, но я стараюсь идти к своей цели. \n\n\n\n\n Но есть один минус. Это лень. И иногда она побеждает\n\n\n\n",
      "published_at": "2025-04-11"
    },
    {
      "id": "003",
      "title": "Начало мечты 3",
      "img_url": "https://dummyimage.com/280x150",
      "content": "Равным образом сложившаяся структура организации способствует подготовки и реализации существенных финансовых и административных условий. Повседневная практика показывает, что консультация с широким активом влечет за собой процесс внедрения и модернизации соответствующий условий активизации. Равным образом начало повседневной работы по формированию позиции позволяет оценить значение соответствующий условий активизации. \n \nТоварищи! консультация с широким активом требуют определения и уточнения соответствующий условий активизации. Таким образом дальнейшее развитие различных форм деятельности играет важную роль в формировании направлений прогрессивного развития.С другой стороны консультация с широким активом способствует подготовки и реализации систем массового участия. Повседневная практика показывает, что постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании системы обучения кадров, соответствует насущным потребностям. Значимость этих проблем настолько очевидна, что постоянный количественный рост и сфера нашей активности требуют от нас анализа новых предложений. С другой стороны начало повседневной работы по формированию позиции способствует подготовки и реализации новых предложений. Не следует, однако забывать, что рамки и место обучения кадров играет важную роль в формировании существенных финансовых и административных условий.\n\n",
      "published_at": "2025-04-16"
    },
    {
      "id": "006",
      "title": "Будущие",
      "img_url": "https://dummyimage.com/280x150",
      "content": "Равным образом сложившаяся структура организации способствует подготовки и реализации существенных финансовых и административных условий. Повседневная практика показывает, что консультация с широким активом влечет за собой процесс внедрения и модернизации соответствующий условий активизации. Равным образом начало повседневной работы по формированию позиции позволяет оценить значение соответствующий условий активизации. Равным образом укрепление и развитие структуры требуют от нас анализа системы обучения кадров, соответствует насущным потребностям. \n \nТоварищи! консультация с широким активом требуют определения и уточнения соответствующий условий активизации. Таким образом дальнейшее развитие различных форм деятельности играет важную роль в формировании направлений прогрессивного развития.С другой стороны консультация с широким активом способствует подготовки и реализации систем массового участия. Повседневная практика показывает, что постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании системы обучения кадров, соответствует насущным потребностям. Значимость этих проблем настолько очевидна, что постоянный количественный рост и сфера нашей активности требуют от нас анализа новых предложений. С другой стороны начало повседневной работы по формированию позиции способствует подготовки и реализации новых предложений. Не следует, однако забывать, что рамки и место обучения кадров играет важную роль в формировании существенных финансовых и административных условий.\n \nРазнообразный и богатый опыт рамки и место обучения кадров представляет собой интересный эксперимент проверки систем массового участия. Повседневная практика показывает, что укрепление и развитие структуры в значительной степени обуславливает создание новых предложений. Задача организации, в особенности же сложившаяся структура организации представляет собой интересный эксперимент проверки системы обучения кадров, соответствует насущным потребностям. Задача организации, в особенности же постоянный количественный рост и сфера нашей активности позволяет оценить значение системы обучения кадров, соответствует насущным потребностям. Таким образом сложившаяся структура организации позволяет оценить значение направлений прогрессивного развития.",
      "published_at": "2025-05-11"
    },
    {
      "id": "0eac",
      "title": "Создаю новую статью",
      "img_url": "https://images.steamusercontent.com/ugc/52453354080448818/543783B601D5A853E3F50907B9722A314DFD92B6/?imw=512&amp;imh=320&amp;ima=fit&amp;impolicy=Letterbox&amp;imcolor=%23000000&amp;letterbox=true",
      "content": "Очень даже интересно\n\n\n\n\nБудет ли работать. ",
      "published_at": "2025-05-23 12:27"
    },
    {
      "id": "9e8a",
      "title": "sdadsa",
      "img_url": "https://s1.1zoom.ru/big3/399/339975-svetik.jpg",
      "content": "sdadasd sdsddaddsa",
      "published_at": "2025-05-23 12:44"
    },
    {
      "id": "45fc",
      "title": "Проверка 3",
      "img_url": "https://s1.1zoom.ru/big3/399/339975-svetik.jpg",
      "content": "Есть над чем задуматься: элементы политического процесса объективно рассмотрены соответствующими инстанциями. Картельные сговоры не допускают ситуации, при которой стремящиеся вытеснить традиционное производство, нанотехнологии, которые представляют собой яркий пример континентально-европейского типа политической культуры, будут рассмотрены исключительно в разрезе маркетинговых и финансовых предпосылок. С учётом сложившейся международной обстановки, сложившаяся структура организации не оставляет шанса для существующих финансовых и административных условий.\n\nПринимая во внимание показатели успешности, высококачественный прототип будущего проекта предоставляет широкие возможности для распределения внутренних резервов и ресурсов! Сложно сказать, почему акционеры крупнейших компаний ограничены исключительно образом мышления. Значимость этих проблем настолько очевидна, что повышение уровня гражданского сознания способствует повышению качества вывода текущих активов. И нет сомнений, что явные признаки победы институционализации будут ассоциативно распределены по отраслям. В рамках спецификации современных стандартов, сделанные на базе интернет-аналитики выводы неоднозначны и будут призваны к ответу.\n\nКаждый из нас понимает очевидную вещь: укрепление и развитие внутренней структуры однозначно фиксирует необходимость соответствующих условий активизации. Мы вынуждены отталкиваться от того, что высокое качество позиционных исследований предопределяет высокую востребованность своевременного выполнения сверхзадачи. Предварительные выводы неутешительны: повышение уровня гражданского сознания однозначно определяет каждого участника как способного принимать собственные решения касаемо распределения внутренних резервов и ресурсов. Задача организации, в особенности же консультация с широким активом, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для укрепления моральных ценностей. Равным образом, постоянный количественный рост и сфера нашей активности, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для анализа существующих паттернов поведения.",
      "published_at": "2025-05-23 12:52"
    },
    {
      "id": "c6fc",
      "title": "sdaasddsa",
      "img_url": "https://ae01.alicdn.com/kf/HTB1LQIMmZjI8KJjSsppq6xbyVXas/round-or-square-Diy-5D-Diamond-Painting-Scenic-3D-Cross-Stitch-Kit-Full-Rhinestone-Ribbon-Embroidery.jpg",
      "content": "dasddsasasda sadasd",
      "published_at": "2025-05-23 13:18"
    },
    {
      "id": "0638",
      "title": "sdadsasad",
      "img_url": "https://ae01.alicdn.com/kf/HTB1LQIMmZjI8KJjSsppq6xbyVXas/round-or-square-Diy-5D-Diamond-Painting-Scenic-3D-Cross-Stitch-Kit-Full-Rhinestone-Ribbon-Embroidery.jpg",
      "content": "sasadasdas sdaasdasdd",
      "published_at": "2025-05-23 13:42"
    },
    {
      "id": "66d0",
      "title": "Все только начинается. По крайней мере, я так думаю.",
      "img_url": "https://avatars.mds.yandex.net/i?id=11ad4cbe8eef7c49ce40c1f49261785a_l-5483658-images-thumbs&n=13",
      "content": "Все не совсем просто, как я думал, когда начинал учить IT год назад.\nУже совсем скоро будет диплом, а я очень сильно проседаю \n\n\nНадеюсь успеть наверстать хоть что то",
      "published_at": "2025-05-26 10:31"
    },
    {
      "id": "ce41",
      "title": "пробаы",
      "img_url": "https://i.pinimg.com/originals/33/d0/2c/33d02c67b4a6e90abe2d7a58f764edd8.jpg",
      "content": "Но действия представителей оппозиции неоднозначны и будут преданы социально-демократической анафеме. Как принято считать, акционеры крупнейших компаний набирают популярность среди определенных слоев населения, а значит, должны быть преданы социально-демократической анафеме. С другой стороны, синтетическое тестирование, в своём классическом представлении, допускает внедрение дальнейших направлений развития.\n\nА также сделанные на базе интернет-аналитики выводы, превозмогая сложившуюся непростую экономическую ситуацию, в равной степени предоставлены сами себе. Безусловно, экономическая повестка сегодняшнего дня однозначно определяет каждого участника как способного принимать собственные решения касаемо первоочередных требований. И нет сомнений, что действия представителей оппозиции призывают нас к новым свершениям, которые, в свою очередь, должны быть указаны как претенденты на роль ключевых факторов. Но предприниматели в сети интернет набирают популярность среди определенных слоев населения, а значит, должны быть рассмотрены исключительно в разрезе маркетинговых и финансовых предпосылок.",
      "published_at": "2025-05-26 10:44"
    }
  ],
  "sessions": [
    {
      "id": "01dd",
      "hash": "0.68133393222721427839871921605663374066352844238281",
      "user": {
        "id": "67ff",
        "login": "alex",
        "password": "qwerty123",
        "registeredAt": "2025-04-10 09:00",
        "roleId": 0
      }
    },
    {
      "id": "776c",
      "hash": "0.59846620475800804683785827364772558212280273437500",
      "user": {
        "id": "797d",
        "login": "Julia",
        "password": "qwerqwer",
        "registeredAt": "2025-05-19 14:53",
        "roleId": 1
      }
    },
    {
      "id": "3ded",
      "hash": "0.37802849159250295763001759041799232363700866699219",
      "user": {
        "id": "67ff",
        "login": "alex",
        "password": "qwerty123",
        "registeredAt": "2025-04-10 09:00",
        "roleId": 0
      }
    },
    {
      "id": "7f21",
      "hash": "0.31328186506967115043664762197295203804969787597656",
      "user": {
        "id": "67ff",
        "login": "alex",
        "password": "qwerty123",
        "registeredAt": "2025-04-10 09:00",
        "roleId": 0
      }
    },
    {
      "hash": "0.47237736294680909843179961171699687838554382324219",
      "user": {
        "id": "67ff",
        "login": "alex",
        "password": "qwerty123",
        "registeredAt": "2025-04-10 09:00",
        "roleId": 0
      },
      "id": "fP_HMZ0"
    },
    {
      "hash": "0.15102642185788561768333693180466070771217346191406",
      "user": {
        "id": "67ff",
        "login": "alex",
        "password": "qwerty123",
        "registeredAt": "2025-04-10 09:00",
        "roleId": 0
      },
      "id": "2xnzHyZ"
    },
    {
      "id": "cf93",
      "hash": "0.50096000635407533785325995268067345023155212402344",
      "user": {
        "id": "67ff",
        "login": "alex",
        "password": "qwerty123",
        "registeredAt": "2025-04-10 09:00",
        "roleId": 0
      }
    }
  ],
  "comments": [
    {
      "id": "3e0f",
      "author_id": "67ff",
      "author_login": "alex",
      "post_id": "c6fc",
      "content": "sdaasdsad",
      "published_at": "2025-05-23 13:34"
    },
    {
      "id": "8f9b",
      "author_id": "67ff",
      "author_login": "alex",
      "post_id": "002",
      "content": "sdadsaasdasd",
      "published_at": "2025-05-28 12:30"
    },
    {
      "id": "7a11",
      "author_id": "67ff",
      "author_login": "alex",
      "post_id": "006",
      "content": "dsasddsa",
      "published_at": "2025-05-29 11:29"
    },
    {
      "id": "0168",
      "author_id": "67ff",
      "author_login": "alex",
      "post_id": "006",
      "content": "Комментарий для проверки",
      "published_at": "2025-05-29 11:29"
    },
    {
      "author_id": "67ff",
      "author_login": "alex",
      "post_id": "003",
      "content": "выфывфыв",
      "published_at": "2025-06-02 12:37",
      "id": "8K0DDjj"
    },
    {
      "author_id": "67ff",
      "author_login": "alex",
      "post_id": "003",
      "content": "вфыфыфв",
      "published_at": "2025-06-02 12:37",
      "id": "MevIID-"
    },
    {
      "author_id": "67ff",
      "author_login": "alex",
      "post_id": "003",
      "content": "fsdsffsddsfd",
      "published_at": "2025-06-04 11:19",
      "id": "f4S13d1"
    }
  ]
}